<?php

// заглавието на страницата
$title = "За НАБЛК";

// извикване хедъра
require_once("header.php");

?>

		<!-- Заглавие -->
		<header>
			<h1>За НАБЛК</h1>
		</header>

		<!-- Основно съдържание на страницата -->
		<div id="content">
			<p>Националната агенция за борба с лошото кодене, наричана за по кратно НАБЛК (произнася се "На! Бълък!"),
			се занима с разследване на най-големите производители и дистрибутори на лоши кодери и учители на лоши
			практики, които водят до сериозни увреждания на популацията от кодери в страната.</p>

			<p>Притеснителен е факта, че все повече млади хора опитват да кодят, като стартовата възраст пада значително и в момента дори и ученици се опитват да кодят в домашни условия или в малки социални групи.</p>

			<p>Все повече ученици признават че са писали HTML и CSS, повече от веднъж, като процента на зависимите (самоупределяйки се като уебмастъри) е притеснително висок. А това е само началото, след HTML и CSS голям процент от уебмастърите започват да кодят и с по-опасни езици, като JavaScript, PHP дори Ruby.</p>

			<p>Успокоителен до някъде е факта, че качеството на масово използваните езици се подобрява, като все
			по-малко начинаещи кодери практикуват мозъчноувреждащи езици като Perl, Basic и подобни архаични извращения.</p>

			<p>НАБЛК е създадена с цел да изобличи най-сериозните производители на лоши кодери в България, като следи
			всички самозвани код-дилъри (частни учители), фирми, школи, академии и дори университети зарибяващи с празни обещания наивници, взимайки им парите и увреждайки ги необратимо, в резултат на което те стават лоши кодери.</p>

			<p>Специалния таскфорс с кодово наименование "Blueberry" разследва сигнал срещу новосформираната групировка <a href="http://softuni.bg" target="_blank">SoftUni</a>. Подробности с техните разкрития можете да следите в раздел - <a href="blueberry.html#reports">Доклади</a></p>
		</div>

<?php

// извикваме футъра
require_once("footer.php");

?>