<?php

// заглавието на страницата
$title = "OП \"Blueberry\"";

// извикване хедъра
require_once("header.php");

?>

		<!-- Заглавие -->
		<header>
			<h1>Операция "Blueberry"</h1>
		</header>

		<!-- Основно съдържание на страницата -->
		<div id="content">


		<h3>Цел на операцията</h3>

		<p><strong>Донус:</strong> "SoftUni е законно регистриран като ООД, като основната му дейност е "обучение",
                    но тайно работи, като университет много по опасен от ФМИ, ТУ и другите класически производители на пишман
                    кодери в страната. За разлика от тях обаче в SoftUni таксите са по-достъпни, липсват извратените висши математики
                    и предмети за пълнеж, както и има възможност за безплатен достъп до всичките опасни материали, произвеждани от
                    университета. Притеснително е и че организацията има свои собствен обръч от фирми, които се подвизават като
                    партньори и зарибяват още повече наивниците с обещания за дипломи."</p>

		<p>Въпреки всичко това обаче срещу организацията няма достатъчно данни и събрани доказателства, така че за момента единствено е поставена под наблюдение от агенти на НАБЛК.</p>

		<p>За тази цел през октомври 2014 година НАБЛК стартира спец операция с кодово наименование "Blueberry", чийто екип от елитни агенти е изпратен под прикритие в SoftUni с цел събиране на разузнавателни данни за опасните дейности извършвани от организацията.</p>


		<h3 id="reports">Доклади</h3>

			<p style="white-space:pre-line;">
				Доклад 1-ви: лято 2014 г. от агент Аноннимен.
				Отностно: Ниво 0 организирано от SoftUni
				Впечатления: Най-лошите кодери са елиминирани след изпита за ниво 0,в
                                останалите подлежат на допълнително оценяване.
				Препоръки:  Препоръчвам допълнителни наблюдения за практиките в ниво 1.
			</p>

			<p style="white-space:pre-line;">
				Доклад 2-ри: септември 2014 г. от агент Аноннимен2.
				Отностно: Ниво 1 - Java Basics организирано от SoftUni
				Впечатления: Премахване на още една група лоши кодери. Започва да се очертава практика на отсяване.
				Препоръки:  Препоръчвам допълнителни наблюдения за практиките в ниво 1.
			</p>


			<h3>Заключение</h3>


			<p> След анализ на събраните данни не намираме SoftUni за заплаха на националната сигурност,
			всички кодери, които си взимат успешно изпитите и завършат университета няма да бъдат лоши по смисъла на
			дефиницията определена от НАБЛК, следователно приемаме че SoftUni не подготвя лоши кодери.</p>
		</div>

<?php

// извикваме футъра
require_once("footer.php");

?>