<?php

// заглавието на страницата
$title = "Екип";

// извикване хедъра
require_once("header.php");

?>

		<!-- Заглавие -->
		<header>
			<h1>Екип</h1>
		</header>

		<!-- Основно съдържание на страницата -->
		<div id="content">

			<div class="profile">
				<img src="img/team/valia-crop.jpg" alt="valia">
				<a style="width:575px;margin-bottom:20px" href="https://softuni.bg/users/profile/show/valia">Valia Delibasheva</a>
				<p>Агент Валя Делибашева е родена в семейство на бачкатори и още от малка търси всякакви
				  начини да се измъкне от заобикалящата я среда. Като тинейджър вижда такъв шанс в езиците и
				  започва да изучава френски и английски език в ГПЧЕ „Алеко Константинов” гр. Правец.</p>
                <p> След това се насочва в сверата на финансите и  продължава своето обучение в ВУЗФ
			      гр. София. Завършва своето образование през 2009г. и става гений на бълъците(бакалаврите).
				  През 2010г. агент Делибашева се разболява от тежка болест, наречена „Мързел” и в продължение
				  на някалко години спира всякакъв контакт с подобни опасни организации като ВУЗФ.</p>
				<p> След продължителното си лечение, през 2012г. намира сили да продължи своето образование
				  като магистър и записва в УНИБИТ. Започва да изучава различни нови езици, като С++, С#,
				  HTML, Java Script и други.  Тя твърдо е решена, че иска да бъде не само гений на
				  бълъците, но и гений на мафиотите(магистрите). Но за да стане силен и уважаван мафиот,
				  трябва да се сблъска лице в лице с много лоши кодери и да ги победи.</P>
				<p> През май 2014г., нейн приятел и съобщава за новосвормираната гропировка SoftUni,
				  която има за цел да обучи своите служители да пишат на всякакви програмни езици. Без да
				  се замисля агент Делибашева подава документи и започва работа като пишман-програмист.
				  За да участва в добре организираните проекти, съсдадени от SoftUni, трябва да се пребори
				  с всички лоши кодери в страната. За съжаление първият и опит бил неуспешен и се оказва че,
				  и тя е една от лошите кодери, които са пречка за страната си. Въпреки трудностите,
				  в които попада, тя не се предава и решава през август 2014 да опита отново. Тогава тя
				  минава на страната на добрите кодери. Но SoftUni са силна групировка и през септември я
				  въвличат в нов проект наречен „Java Bacic”.</p>
                <p> По същото време и предлагат рабата като таен агент в Националната агенция за борба с
				  лошото кодене, наричана за по кратно НАБЛК (произнася се "На! Бълък!"), се занима с
				  разследване на най-големите производители и дистрибутори на лоши кодери и учители на
				  лоши практики, които водят до сериозни увреждания на популацията от кодери в страната.
				  Нейната първа мисия е операция, наречена „Huckleberry”. Целта на мисията и тогава била
				  да направи игра заедно с другите берита агенти и да се докаже като един истински
				  пишман-програмист. Мисията преминава успешно и успява да заблуди SoftUni, че е станала
				  една от тях.</p>
                <p> През октомври 2014г. НАБЛК стартира спец операция с кодово наименование "Blueberry",
				  чийто екип от елитни агенти е изпратен под прикритие в SoftUni с цел събиране на
				  разузнавателни данни за опасните дейности извършвани от организацията.</p>

			</div>

			<div class="clear"></div>

			<div class="profile">
				<img src="img/team/roumen-crop.jpg" alt="roumen">
				<a style="width:575px;margin-bottom:20px" href="https://softuni.bg/users/profile/show/roumen">Румен Дамянов</a>
				<p> Агент Румен Дамянов известен в deep web повече с никнейма FrAgMaKeR е реабилитиран хакер, който до скоро беше считан за враг на агенцията, но в момента вече е успешно вербуван за редови агент и се издига с бързи темпове в йерархията на НАБЛК.</p>
				<p>Роден е доста одавна в град Пловдив, завършва успешно Националната Търговска Гимназия в града като Икономист в Банковото дело, но така и не иска да стане банкер и по-добре, защото в този период крива от правия път и се отдава на доста вредни навици. Които включват гледане на филми, играене на игри и висене по чатове в IRC. </p>
				<p>За пръв път попада в полезрението на агенцията в качеството си на модератор в голям пловдивски форум борещ се с ламерството той се опитва да дава акъл на месните нубчета. Кариерата му се развива с бесни темпове и той става администратор на най-големия Пловдивски форум който става и един от най-големите в страната. Също така бива администратор на едни от най-големите и успешни наши dc хъбове, торент тракери, чат сървъри, гейм сървъри и други съмнителни виртуални организации. Във всички тях той си създава репотация на съдестично жесток унищожител на спамери, тролове, чийтъри, промоутъри и друга подобна сган.</p>
				<p>За пръв път опитва да коди след като прочита статия във вестник за това как да си направим сайт с HTML4 през далечната 2000 година. Купува си и книжка от поредицата "В лесни стъпки" и започва да коди въпреки че все още няма домашен компютър нито интернет, той пише код и чертае дизайни върху листове хартия. Разбира се тогава той е лош кодер, първо защото пише лош спагети код и второ защото си вярва че писането на HTML4 == програмиране.</p>
				<p>Година по-късно обаче открива IRC и решава да си направи скрипт, като без да осъзнава в опитите си да направи нещо, което да работи научава какво са условен оператор, цикъл, как се работи с промениливи и функции. След това от любопитство си купува книжка за C++, обаче не стига до никъде защото няма Visual Studio 6.0 в къщи, а е твърде голям за да го сваля през dial-up връзката си от еБТК. Все пак още една година по-късно пак се връща към C++, след като е принуден да учи Pascal в училище, а синтаксиса му е твърде приятен за да може да го понесе. Случайно си купува и книжка за JAVA по погрешка, защото не знаел че има разлика между Java и JavaScript, но отново не стига далеч сам.. затова решава че ще става дизайнер. След като понаучава малко как се работи с Photoshop, Fireworks и Flash решава че не го бива за тая работа и пожелава да стане системен администратор. Без да има и грам опит, работодател който пък няма грам мозък му дава пълен достъп до сървърите си с надежда че ще ги пази, като в крайна сметка самият той се оказва най-голямата заплаха, защото ползва командата rm -rf / вместо ls -la /, но така поне научава какво не трябва да се прави. </p>
				<p>След като преди няколко години намира безплатни лекции по програмиране от Станфорд и Ем Ай Ти се връща към програмирането въпреки, че вече е промит мозък, който сам си "билдва линукса" и дори стартира нещо като хостинг компания, въпреки че нито има пари, нито има план, нито има достъчно технически знания.. е все пак не е пълен провал, даже има и малка печалба от цялата тая работа, поне научава как не се прави успешен бизнес.</p>
				<p>С други думи нашия заблуден агент идеално се вписва в профила на пишман кодерите които се записват в СофтУни, иска му се да си позапълни сивито и да вземе диплома, но хич не му се минава през ФМИ заради гадните математики и още по-гадните дъртофелници там.</p>
				<p>През 2014 година той получва задача да се присъедени към "Blueberry" и да влезе в СофтУни като студент под прикритие, който се учи да коди, а целта му е да наблюдава и оценява методите на преподаване като периодично си прави тестове за това дали е подобрил нивото си или е станал още по-лош кодер от колкото си е бил преди това. Така ще се разбере дали СофтУни създава кадърни кодери или е поредното ораганизация която бълва пълни некадърници на пазара на труда в страната. </p>
			</div>

			<div class="clear"></div>


		</div>

<?php

// извикваме футъра
require_once("footer.php");

?>