<?php

// заглавието на страницата
$title = "Валя Делибашева";

// извикване хедъра
require_once("header.php");

?>

		<!-- Заглавие -->
		<header>
			<h1>Профил на агент: Валя Делибашева</h1>
		</header>

		<!-- Основно съдържание на страницата -->
		<div id="content">

			<div class="profile">
				<img src="img/team/valia-crop.jpg" alt="valia">
				<a style="width:575px;margin-bottom:20px" href="https://softuni.bg/users/profile/show/valia">Valia Delibasheva</a>
				<p>Агент Валя Делибашева е родена в семейство на бачкатори и още от малка търси всякакви
				  начини да се измъкне от заобикалящата я среда. Като тинейджър вижда такъв шанс в езиците и
				  започва да изучава френски и английски език в ГПЧЕ „Алеко Константинов” гр. Правец.</p>
                <p> След това се насочва в сверата на финансите и  продължава своето обучение в ВУЗФ
			      гр. София. Завършва своето образование през 2009г. и става гений на бълъците(бакалаврите).
				  През 2010г. агент Делибашева се разболява от тежка болест, наречена „Мързел” и в продължение
				  на някалко години спира всякакъв контакт с подобни опасни организации като ВУЗФ.</p>
				<p> След продължителното си лечение, през 2012г. намира сили да продължи своето образование
				  като магистър и записва в УНИБИТ. Започва да изучава различни нови езици, като С++, С#,
				  HTML, Java Script и други.  Тя твърдо е решена, че иска да бъде не само гений на
				  бълъците, но и гений на мафиотите(магистрите). Но за да стане силен и уважаван мафиот,
				  трябва да се сблъска лице в лице с много лоши кодери и да ги победи.</P>
				<p> През май 2014г., нейн приятел и съобщава за новосвормираната гропировка SoftUni,
				  която има за цел да обучи своите служители да пишат на всякакви програмни езици. Без да
				  се замисля агент Делибашева подава документи и започва работа като пишман-програмист.
				  За да участва в добре организираните проекти, съсдадени от SoftUni, трябва да се пребори
				  с всички лоши кодери в страната. За съжаление първият и опит бил неуспешен и се оказва че,
				  и тя е една от лошите кодери, които са пречка за страната си. Въпреки трудностите,
				  в които попада, тя не се предава и решава през август 2014 да опита отново. Тогава тя
				  минава на страната на добрите кодери. Но SoftUni са силна групировка и през септември я
				  въвличат в нов проект наречен „Java Bacic”.</p>
                <p> По същото време и предлагат рабата като таен агент в Националната агенция за борба с
				  лошото кодене, наричана за по кратно НАБЛК (произнася се "На! Бълък!"), се занима с
				  разследване на най-големите производители и дистрибутори на лоши кодери и учители на
				  лоши практики, които водят до сериозни увреждания на популацията от кодери в страната.
				  Нейната първа мисия е операция, наречена „Huckleberry”. Целта на мисията и тогава била
				  да направи игра заедно с другите берита агенти и да се докаже като един истински
				  пишман-програмист. Мисията преминава успешно и успява да заблуди SoftUni, че е станала
				  една от тях.</p>
                <p> През октомври 2014г. НАБЛК стартира спец операция с кодово наименование "Blueberry",
				  чийто екип от елитни агенти е изпратен под прикритие в SoftUni с цел събиране на
				  разузнавателни данни за опасните дейности извършвани от организацията.</p>

			</div>

			<div class="clear"></div>

		</div>

<?php

// извикваме футъра
require_once("footer.php");

?>